renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_dmaca_rx/src/r_dmaca_rx.c
    /* ---- Lock the DMACA channel. ---- */
    g_locking_sw[channel] = 1;

    /* Clear a Activation Request Select Register. */
    ICU_DMRSR(channel)  = 0x00;

    if (0x00 == ICU_DMRSR(channel))
    {
        /* do nothing */
    }

    /* Cancel module stop for DMAC and DTC. */
    r_dmaca_module_enable();

    /* Enable the DMAC activation. */
    DMACA_DMAST = DMACA_ACTIVE_ENABLE;

    /* Check DMAC activating status */
    if (DMACA_ACTIVE_ENABLE == DMACA_DMAST)
    {
        /* do nothing */
    }

    return DMACA_SUCCESS;
}
/**************************************************************************
* End of function R_DMACA_Open
*************************************************************************/

/***********************************************************************************************************************
* Function Name: R_DMACA_Close
********************************************************************************************************************//**
* @brief This function is used to release the resources of the DMAC channel currently in use.
* @param[in] channel DMAC channel number.
* @retval DMACA_SUCCESS Successful operation
* @retval DMACA_SUCCESS_OTHER_CH_BUSY Successful operation. Other DMAC channels are locked.
* @retval DMACA_SUCCESS_DTC_BUSY Successful operation. DTC is locked.
* @retval DMACA_ERR_INVALID_CH Channel is invalid.
* @retval DMACA_ERR_INTERNAL DMACA driver internal error.
* @details See Section 3 in the application note for details.
* @note When controlling the DTC without using the DTC FIT module, make sure to monitor the usage of the DTC and
* control locking and unlocking of the DTC so that calling this function does not set the DTC to the module stop
* state. Note that even if the DTC has not been activated, it is necessary to keep it in the locked state when not
* making DTC transfer settings.
*/
dmaca_return_t R_DMACA_Close(uint8_t channel)
{
    dmaca_chk_locking_sw_t result_chk_locking_sw = DMACA_ALL_CH_UNLOCKED_AND_DTC_UNLOCKED;

#if (1 == DMACA_CFG_PARAM_CHECKING_ENABLE)

    /* Check argument. */
    if (false == r_dmaca_channel_valid_check(channel))
    {
        return DMACA_ERR_INVALID_CH;
    }
#endif /* DMACA_CFG_PARAM_CHECKING_ENABLE */

    /* Clear a Activation Request Select Register. */
    ICU_DMRSR(channel)  = 0x00;

    if (0x00 == ICU_DMRSR(channel))
    {
        /* do nothing */
    }

    /* Disable DMA transfers. */
    DMACA_DMCNT(channel) = DMACA_TRANSFER_DISABLE;

    /* Unlock DMACA hardware to the specified channel. */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_DMAC0 + channel));

    /* ---- Unlock the DMACA channel. ---- */
    g_locking_sw[channel] = 0;

    /* Check locking of DMACA and DTC. */
    result_chk_locking_sw = r_dmaca_check_locking_sw();

    switch (result_chk_locking_sw)
    {
        case DMACA_ALL_CH_UNLOCKED_AND_DTC_UNLOCKED: /* All DMAC channels and DTC are unlocked. */
        {
            /* Disable the DMAC activation. */
            DMACA_DMAST = DMACA_ACTIVE_DISABLE;

            /* Check DMAC activating status */
            if (DMACA_ACTIVE_DISABLE == DMACA_DMAST)
            {
                /* do nothing */
            }

            /* Set both DMAC and DTC to module stop state. */
            r_dmaca_module_disable();
            #if (1 == DMACA_CFG_USE_DTC_FIT_MODULE)
            R_BSP_HardwareUnlock((mcu_lock_t)BSP_LOCK_DTC);
            #endif
            break;
        }
        case DMACA_ALL_CH_UNLOCKED_BUT_DTC_LOCKED: /* All DMAC channels are unlocked. DTC is locked. */
        {
            /* Disable the DMAC activation. */
            DMACA_DMAST = DMACA_ACTIVE_DISABLE;

            /* Check DMAC activating status */
            if (DMACA_ACTIVE_DISABLE == DMACA_DMAST)
            {
                /* do nothing */
            }
            return DMACA_SUCCESS_DTC_BUSY;
            break;
        }
        case DMACA_LOCKED_CH_EXIST: /* Other DMAC channels are locked. */
        {
            return DMACA_SUCCESS_OTHER_CH_BUSY;
            break;
        }
        default:
        {
            return DMACA_ERR_INTERNAL;
            break;
        }
    }

    return DMACA_SUCCESS;
}
/**************************************************************************
* End of function R_DMACA_Close
*************************************************************************/

/***********************************************************************************************************************
* Function Name: R_DMACA_Create
********************************************************************************************************************//**
* @brief This function is used to make DMAC register settings and to specify the activation source.
* @param[in] channel DMAC channel number.
* @param[in] p_data_cfg Pointer to dmaca_transfer_data_cfg_t DMAC transfer information structure.
* See Section 3 in the application note for details.
* @retval DMACA_SUCCESS Successful operation
* @retval DMACA_ERR_INVALID_CH Channel is invalid.
* @retval DMACA_ERR_INVALID_ARG Parameters are invalid.
* @retval DMACA_ERR_NULL_PTR Argument pointers are NULL.
* @details References the dmaca_transfer_data_cfg_t DMAC transfer information structure passed as an argument and makes
* register settings for the specified DMAC channel. Also specifies the activation source for the DMAC channel.
* @note None.
*/
dmaca_return_t R_DMACA_Create(uint8_t channel, dmaca_transfer_data_cfg_t *p_data_cfg)
{
#if (1 == DMACA_CFG_PARAM_CHECKING_ENABLE)

    /* Check argument. */
    if (false == r_dmaca_channel_valid_check(channel))
    {
        return DMACA_ERR_INVALID_CH;
    }

    /* Check argument. */
    if ((uint32_t)NULL == (uint32_t)p_data_cfg)
    {
        return DMACA_ERR_NULL_PTR;
    }
#endif /* DMACA_CFG_PARAM_CHECKING_ENABLE */

    if (false == r_dmaca_set_transfer_data(channel, p_data_cfg))
    {
        /* Fail to apply configurations for Transfer data. */
        return DMACA_ERR_INVALID_ARG;
    }

