renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_dmaca_rx/src/r_dmaca_rx.c
    return DMACA_SUCCESS;
}
/**************************************************************************
* End of function R_DMACA_Create
*************************************************************************/

/***********************************************************************************************************************
* Function Name: R_DMACA_Control
********************************************************************************************************************//**
* @brief This function is used to control the operation of the DMAC. This function is run after calling R_DMACA_Open().
* @param[in] channel DMAC channel number.
* @param[in] command DMAC control command.
* See Section 3 in the application note for details.
* @param[in] p_stat Pointer to dmaca_stat_t DMAC status information structure.
* See Section 3 in the application note for details.
* @retval DMACA_SUCCESS Successful operation
* @retval DMACA_ERR_INVALID_CH Channel is invalid.
* @retval DMACA_ERR_INVALID_COMMAND Command is invalid.
* @retval DMACA_ERR_NULL_PTR Argument pointers are NULL.
* @retval DMACA_ERR_SOFTWARE_REQUESTED DMA transfer request by software has been generated already. See Section 3 in the application note for details.
* @retval DMACA_ERR_SOFTWARE_REQUEST_DISABLED Transfer Request Source is not Software. See Section 3 in the application note for details.
* @details See Section 3 in the application note for details.
* @note In the case of waiting for the transfer end by using DMAC channel 4-7 and an interrupt, please clear a transfer
*  escape interrupt flag (ESIF) or a transfer end interrupt flag (DTIF) using a callback function for transfer end
*  interrupts/transfer escape end interrupts.
*/
dmaca_return_t R_DMACA_Control(uint8_t channel, dmaca_command_t command, dmaca_stat_t *p_stat)
{
    uint8_t dmaca_interrupt_status = 0x00;
    uint8_t dmaca_soft_req_status  = 0x00;
    uint16_t dmaca_dmtmd = 0x0000;

#if (1 == DMACA_CFG_PARAM_CHECKING_ENABLE)

    /* Check argument. */
    if (false == r_dmaca_channel_valid_check(channel))
    {
        return DMACA_ERR_INVALID_CH;
    }
#endif /* DMACA_CFG_PARAM_CHECKING_ENABLE */

    switch (command)
    {
        case DMACA_CMD_ENABLE: /* Enable DMA transfer of the specified channel. */
        case DMACA_CMD_RESUME: /* Resume DMA transfer of the specified channel. */
        {
            /* Enable transfer for the corresponding channel */
            DMACA_DMCNT(channel) = DMACA_TRANSFER_ENABLE;

            /* Check transfer of the corresponding channel */
            if (DMACA_TRANSFER_ENABLE == DMACA_DMCNT(channel))
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_DISABLE: /* Disable DMA transfer of the specified channel. */
        {
            /* Disable transfer for the corresponding channel */
            DMACA_DMCNT(channel) = DMACA_TRANSFER_DISABLE;

            /* Check transfer of the corresponding channel */
            if (DMACA_TRANSFER_DISABLE == DMACA_DMCNT(channel))
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_ALL_ENABLE: /* Enable DMAC activation. */
        {
            /* Enable DMAC */
            DMACA_DMAST = DMACA_ACTIVE_ENABLE;

            /* Check DMAC activating status */
            if (DMACA_ACTIVE_ENABLE == DMACA_DMAST)
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_ALL_DISABLE: /* Disable DMAC activation. */
        {
            /* Disable DMAC */
            DMACA_DMAST = DMACA_ACTIVE_DISABLE;

            /* Check DMAC activating status */
            if (DMACA_ACTIVE_DISABLE == DMACA_DMAST)
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_SOFT_REQ_WITH_AUTO_CLR_REQ: /* DMA transfer by Software using DMREQ.SWREQ bit Auto Clear mode */
        {
            /* Check DMTMD.DCTG[1:0] bits. */
            if ((DMACA_DMTMD(channel) & DMACA_REQ_BIT_MASK) != DMACA_TRANSFER_REQUEST_SOFTWARE)
            {
                return DMACA_ERR_SOFTWARE_REQUEST_DISABLED;
            }

            /* Check a DMREQ.CLRS bit. */
            if (0 == (DMACA_DMREQ(channel) & DMACA_CLRS_BIT_MASK))
            {
                /* Check a DMREQ.SWREQ bit. */
                if (0 !=  (DMACA_DMREQ(channel) & DMACA_SWREQ_BIT_MASK))
                {
                    return DMACA_ERR_SOFTWARE_REQUESTED;
                }
            }

            /* DMA transfer by software is requested and request flag is cleared automatically. */
            DMACA_DMREQ(channel) = DMACA_SOFT_REQ_WITH_AUTO_CLR_REQ;

            /* Check DMREQ. */
            if (DMACA_SOFT_REQ_WITH_AUTO_CLR_REQ == DMACA_DMREQ(channel))
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_SOFT_REQ_NOT_CLR_REQ: /* DMA transfer by Software */
        {
            /* Check DMTMD.DCTG[1:0] bits. */
            if ((DMACA_DMTMD(channel) & DMACA_REQ_BIT_MASK) != DMACA_TRANSFER_REQUEST_SOFTWARE)
            {
                return DMACA_ERR_SOFTWARE_REQUEST_DISABLED;
            }

            /* DMA transfer by software is requested and request flag is not cleared. */
            DMACA_DMREQ(channel) = DMACA_SOFT_REQ_NOT_CLR_REQ;

            /* Check DMREQ. */
            if (DMACA_SOFT_REQ_NOT_CLR_REQ == DMACA_DMREQ(channel))
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_SOFT_REQ_CLR: /* Clear DMREQ.SWREQ bit. */
        {
            /* Check DMTMD.DCTG[1:0] bits. */
            if ((DMACA_DMTMD(channel) & DMACA_REQ_BIT_MASK) != DMACA_TRANSFER_REQUEST_SOFTWARE)
            {
                return DMACA_ERR_SOFTWARE_REQUEST_DISABLED;
            }

            /* Clear DMREQ.SWREQ bit. */
            DMACA_DMREQ(channel) &= (~DMACA_SWREQ_BIT_MASK);

            /* Check DMREQ. */
            if (0x00 == (DMACA_DMREQ(channel) & DMACA_SWREQ_BIT_MASK))
            {
                /* do nothing */
            }
            break;
        }

