renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_dmaca_rx/src/r_dmaca_rx.c
        case DMACA_CMD_STATUS_GET:
        {
#if (1 == DMACA_CFG_PARAM_CHECKING_ENABLE)
            /* Check argument. */
            if ((uint32_t)NULL == (uint32_t)p_stat)
            {
                return DMACA_ERR_NULL_PTR;
            }
#endif /* DMACA_CFG_PARAM_CHECKING_ENABLE */

            /* Get DMAC status register*/
            dmaca_interrupt_status = DMACA_DMSTS(channel);

            /* Get DMAC software Start register*/
            dmaca_soft_req_status = DMACA_DMREQ(channel);

            if (0 == (dmaca_interrupt_status & DMACA_ACT_BIT_MASK)) /* Get the current status of DMACA. */
            {
                /* DMACA operation is suspended. */
                p_stat->act_stat = false;
            }
            else
            {
                /* DMACA is operating. */
                p_stat->act_stat = true;
            }

            if (0 == (dmaca_interrupt_status & DMACA_DTIF_BIT_MASK)) /* Get the transfer end interrupt flag. */
            {
                /* A transfer end interrupt has not been generated. */
                p_stat->dtif_stat = false;
            }
            else
            {
                /* A transfer end interrupt has been generated. */
                p_stat->dtif_stat = true;
            }

            if (0 == (dmaca_interrupt_status & DMACA_ESIF_BIT_MASK)) /* Get the escape end interrupt flag. */
            {
                /* A transfer escape end interrupt has not been generated. */
                p_stat->esif_stat = false;
            }
            else
            {
                /* A transfer escape end interrupt has been generated. */
                p_stat->esif_stat = true;
            }

            if (0 == (dmaca_soft_req_status & DMACA_SWREQ_BIT_MASK)) /* Get the SWREQ flag. */
            {
                /* A software transfer is not requested. */
                p_stat->soft_req_stat = false;
            }
            else
            {
                /* A software transfer is requested. */
                p_stat->soft_req_stat = true;
            }

            /* Get DMAC transfer mode from the corresponding channel */
            dmaca_dmtmd = DMACA_DMTMD(channel);

            if ((DMACA_TRANSFER_MODE_REPEAT & dmaca_dmtmd) ||
                (DMACA_TRANSFER_MODE_BLOCK & dmaca_dmtmd))
            {
                /* Get transfer count from the corresponding channel */
                p_stat->transfer_count = (uint32_t)DMACA_DMCRB(channel);
            }
            else /* DMACA_TRANSFER_MODE_NORMAL */
            {
                /* Get transfer count from the corresponding channel */
                p_stat->transfer_count = (DMACA_INVALID_LOWER_BIT_MASK & DMACA_DMCRA(channel));
            }
            break;
        }
        case DMACA_CMD_ESIF_STATUS_CLR:
        {
            /* Clears Transfer Escape End Interrupt Flag. */
            DMACA_DMSTS(channel) = ~((uint8_t)DMACA_ESIF_BIT_MASK);

            /* Check DMAC status register */
            if (0x00 == DMACA_DMSTS(channel))
            {
                /* do nothing */
            }
            break;
        }
        case DMACA_CMD_DTIF_STATUS_CLR:
        {
            /* Clears Transfer Interrupt Flag. */
            DMACA_DMSTS(channel) = ~((uint8_t)DMACA_DTIF_BIT_MASK);

            /* Check DMAC status register */
            if (0x00 == DMACA_DMSTS(channel))
            {
                /* do nothing */
            }
            break;
        }
        default:
        {
            return DMACA_ERR_INVALID_COMMAND;
            break;
        }
    }

    return DMACA_SUCCESS;
}
/**************************************************************************
* End of function R_DMACA_Control
*************************************************************************/

/***********************************************************************************************************************
* Function Name: R_DMACA_Init
********************************************************************************************************************//**
* @brief This function is used to initialize the DMAC's internal information.
* @details Initializes the usage status of each DMA channel (internal information). Also, cancels the registered
* callback functions for all DMAC transfer end interrupts/transfer escape end interrupts (DMAC0I, DMAC1I, DMAC2I,
* DMAC3I, and DMAC74I). If DMAC transfer end interrupts/transfer escape end interrupts will be used, run the
* R_DMACA_Init() function beforehand, and then use the R_DMACA_Int_Callback() function (described below) to register
* the callback functions.
* @note When using the DMACA driver, run the R_DMACA_Init() function first. It is recommended to run at hardware setup
* operation.
*/
void R_DMACA_Init(void)
{
    uint32_t i;

    /* Initialize a callback for DMAC interrupts */
    /* WAIT_LOOP */
    for (i = 0; i < DMACA_NUM_CHANNELS; i++)
    {
        /* Initialize callback functions as FIT_NO_FUNC */
        g_pdmaci_handlers[i] = (void *)FIT_NO_FUNC;
        g_locking_sw[i] = 0;
    }
}
/**************************************************************************
* End of function R_DMACA_Init
*************************************************************************/

/***********************************************************************************************************************
* Function Name: R_DMACA_Int_Callback
********************************************************************************************************************//**
* @brief This function is used to register the callback function for the DMAC transfer end interrupt/transfer escape end
*  interrupt.
* @param[in] channel DMAC channel number.
* @param[in] p_callback Pointer to function that is called when a DMAC transfer end interrupt/transfer escape end
* interrupt occurs.
* @retval DMACA_SUCCESS Successful operation
* @retval DMACA_ERR_INVALID_CH Channel is invalid.
* @retval DMACA_ERR_INVALID_HANDLER_ADDR Invalid function address is set.
* @details Registers the callback function for the DMAC transfer end interrupt/transfer escape end interrupt of the
* specified channel. The registration of an already-registered callback function is canceled if FIT_NO_FUNC or NULL
* is passed as the callback argument. Also, the registration of an already-registered callback function is canceled
* if DMACA_ERR_INVALID_HANDLER_ADDR is returned.\n
* Note: The callback function arguments and return values should be of void type
* @note None
*/
dmaca_return_t R_DMACA_Int_Callback(uint8_t channel,  void * p_callback)
{
#if (1 == DMACA_CFG_PARAM_CHECKING_ENABLE)

    /* Check argument. */
    if (false == r_dmaca_channel_valid_check(channel))
    {
        return DMACA_ERR_INVALID_CH;
    }

